Tekla.Structures.Dialog.UIControls.WpfCreateApplyCancel
Interaction logic for WPFCreateAppyCancel.xaml.
Control is meant to be used with non-dependent plug-ins
WpfCreateApplyCancel

Tekla.Structures.Dialog.UIControls.WpfCreateApplyCancel.#ctor
Constructor

Tekla.Structures.Dialog.UIControls.WpfCreateApplyCancel.ApplyClicked
The ApplyClicked event is raised when the Apply button is clicked.

Tekla.Structures.Dialog.UIControls.WpfCreateApplyCancel.CreateClicked
The ApplyClicked event is raised when the Apply button is clicked.

Tekla.Structures.Dialog.UIControls.WpfCreateApplyCancel.CancelClicked
The CancelClicked event is raised when the Cancel button is clicked.

Tekla.Structures.Dialog.UIControls.WpfCreateApplyCancel.InitializeComponent
InitializeComponent